# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [ ]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/Laxminarayen/Inceptz-Batch13-Analytics_and_Python/master/08%20-%20Day%20-%208%20-%20Python%20Quiz%20Session/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [10]:
import pandas as pd
baby_names = pd.read_csv("https://raw.githubusercontent.com/Laxminarayen/Inceptz-Batch13-Analytics_and_Python/master/08%20-%20Day%20-%208%20-%20Python%20Quiz%20Session/06_Stats/US_Baby_Names/US_Baby_Names_right.csv")
baby_names.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1016395 entries, 0 to 1016394
Data columns (total 7 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   Unnamed: 0  1016395 non-null  int64
 1   Id          1016395 non-null  int64
 2   Name        1016395 non-null  object
 3   Year        1016395 non-null  int64
 4   Gender      1016395 non-null  object
 5   State       1016395 non-null  object
 6   Count       1016395 non-null  int64
dtypes: int64(4), object(3)
memory usage: 54.3+ MB

### Step 4. See the first 10 entries

In [11]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [22]:
baby_names.drop()

ValueError: Need to specify at least one of 'labels', 'index' or 'columns'

In [ ]:
and
as
def
continue
else
if
for
break

In [ ]:
del baby_names['unnamed: 0']

In [23]:
baby_names.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

### Step 6. Is there more male or female names in the dataset?

In [25]:
baby_names['Gender'].value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [27]:
del baby_names['Year']
names = baby_names.groupby('Name').sum()
names.sort_values("Count",ascending=False)

            Unnamed: 0          Id   Count
Name
Jacob       1665680788  1665681356  242874
Emma        1629481684  1629482250  214852
Michael     1687520717  1687521295  214405
Ethan       1660807908  1660808475  209277
Isabella    1630131220  1630131786  204798
...                ...         ...     ...
Eniola         4930125     4930126       5
Atlantis       4904426     4904427       5
Marci          4901272     4901273       5
Simarpreet      553385      553386       5
Nita            536781      536782       5

[17632 rows x 3 columns]

### Step 8. How many different names exist in the dataset?

In [28]:
len(names)

17632

### Step 9. What is the name with most occurrences?

In [29]:
baby_names['Name'].nunique()

17632

### Step 10. How many different names have the least occurrences?

In [34]:
names.loc[names.Count == names.Count.max()]

       Unnamed: 0          Id   Count
Name
Jacob  1665680788  1665681356  242874

### Step 11. What is the median name occurrence?

In [36]:
names

         Unnamed: 0         Id  Count
Name
Aaban       7733801    7733803     12
Aadan       7158061    7158065     23
Aadarsh     1728030    1728031      5
Aaden     555052029  555052225   3426
Aadhav       709606     709607      6
...             ...        ...    ...
Zyra       17538998   17539005     42
Zyrah       5487073    5487075     11
Zyren       5074229    5074230      6
Zyria      29787029   29787039     59
Zyriah     34146196   34146205     58

[17632 rows x 3 columns]

### Step 12. What is the standard deviation of names?

In [37]:
names.Count.std()

11006.069467891111

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [38]:
names.describe()

         Unnamed: 0            Id          Count
count  1.763200e+04  1.763200e+04   17632.000000
mean   1.631922e+08  1.631922e+08    2008.932169
std    3.504512e+08  3.504513e+08   11006.069468
min    8.606400e+04  8.606500e+04       5.000000
25%    4.918374e+06  4.918375e+06      11.000000
50%    1.963462e+07  1.963463e+07      49.000000
75%    1.071826e+08  1.071826e+08     337.000000
max    3.223035e+09  3.223036e+09  242874.000000

In [39]:
nlargest() / nsmalest()

NameError: name 'nlargest' is not defined

In [40]:
names.loc[names['Count'] == names.Count.nlargest(2).iloc[-1]]

      Unnamed: 0          Id   Count
Name
Emma  1629481684  1629482250  214852

In [41]:
import numpy as np
np.random.rand(254,830)*254

array([[ 10.53183031,  46.13826287, 205.55197022, ..., 205.94733845,
         85.33353981, 121.80228406],
       [ 54.84190513,  21.09083437,   2.40081818, ..., 154.11928665,
        133.90908074, 115.12507914],
       [208.578117  , 235.7406934 , 167.14711333, ..., 165.71213605,
        213.72134364,  98.51590081],
       ...,
       [181.52482467,  31.31566878,  84.76942299, ..., 244.65509057,
        225.61312218,  42.03403404],
       [247.26560469, 189.73397544, 135.65377741, ..., 183.52147598,
        127.67752866, 126.77382456],
       [180.94067963, 135.2015551 , 213.63963985, ..., 179.29267371,
        113.47459312,  25.98670077]])

In [46]:
import numpy as np
df_float = pd.DataFrame(np.random.rand(25)*20)
#df_float.columns = ['Some_decimal']

In [47]:
df_float.columns=['some _decimal']

In [49]:
RangeIndex(start=0, stop=1, step=1)

NameError: name 'RangeIndex' is not defined

pd.set_option('display.precision',12)

In [50]:
df_float

      some _decimal
0    2.170454661234
1   18.931130716499
2    2.094324653191
3   18.590946521395
4    4.691330585811
5   15.652413678717
6   11.764025157831
7   19.588304164445
8   16.486355419810
9   13.244501833081
10  17.270569631853
11   5.309740094742
12  11.918688531290
13  12.488802296675
14  14.636294380855
15  15.091969499873
16  11.329894432067
17  12.201179976931
18   5.415272290924
19   9.188226415157
20  12.557779451234
21  18.685481579348
22   4.730466931319
23  19.531159087952
24  10.129548726017

In [51]:
import numpy as np
df_float = pd.DataFrame(np.random.rand(25)*20)
df_float.columns = ['Some_decimal']

In [52]:
df_float.round(2)

    Some_decimal
0           8.26
1          12.82
2           7.02
3           9.81
4          18.69
5           6.49
6           2.57
7           9.64
8           7.71
9          11.69
10         18.75
11          3.12
12         14.36
13          7.53
14          3.91
15          1.69
16         15.14
17         14.35
18         15.13
19         12.28
20          4.87
21         17.87
22         11.77
23          8.78
24         12.00